#+TITLE: LaTeX あれこれ
#+LANGUAGE: ja
#+AUTHOR: 島野 善雄
#+EMAIL: shimano.yoshio@jp.fujitsu.com
#+OPTIONS: author:t prop:nil <:nil H:7
#+OPTIONS: toc:4 creator:nil timestamp:nil email:t  todo:nil pri:nil tags:nil
#+DESCRIPTION: LaTeX Tips
#+KEYWORDS:  Ubuntu Linux LaTeX
#+EXCLUDE_TAGS: noexport
#+STARTUP: indent
# 図目次の出力
#+LATEX: \listoffigures
#+TOC: figure
# 表目次の出力
#+TOC: tables 

# HTML Setting
#+INFOJS_OPT: view:showall
# #+INCLUDE: "~/Org/Templates/setup/theme-bigblow.setup" 
#+INCLUDE: "~/Org/Templates/setup/theme-readtheorg.setup" 

# ドキュメントクラスの指定
#+LATEX_CLASS: jsbook
# ドキュメントクラスのオプションの指定
#+LATEX_CLASS_OPTIONS: [a4j,12pt,openany,uplatex]
# カスタムスタイルの読み込み
#+LATEX_HEADER: \usepackage{shimano}

# ファイルのバージョン
#+LATEX_HEADER: \FileVerjou{1.0}

# tcolorbox でのプログラムリスト出力
# #+LATEX: \tcblistof[\chapter*]{box}{プログラムリスト}
#+LATEX: \mainmatter

*** 個人用の LaTeX ファイルを置くディレクトリを作成する
:PROPERTIES:
:ID:       bd56046c-4291-4cc0-97c1-eb46e8c7b621
:END:
:CLOCK:
- State "DONE"       from "NEXT"       [2014-03-04 火 12:10]
CLOCK: [2014-03-04 火 12:00]--[2014-03-04 火 12:10] =>  0:10
CLOCK: [2014-03-04 火 08:37]--[2014-03-04 火 08:40] =>  0:03
CLOCK: [2014-02-28 金 16:54]--[2014-02-28 金 16:55] =>  0:01
:END:

- http://hirono-hideki.sblo.jp/article/33830845.html


** upLaTeX, bibtex, mendex を使った \LaTeX 文書のの処理の順番
:PROPERTIES:
:LOCATION: Office
:Added: [2016-08-31 Wed 17:29]
:ID:       4b76eeda-4fd2-42d5-9cd1-2fe5c824b5b5
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2016-09-01 Thu 10:01]
:END:
:CLOCK:
CLOCK: [2016-08-31 Wed 17:29]--[2016-08-31 Wed 17:30] =>  0:01
:END:

\LaTeX ファイルを処理して PDF を作成する手順は次のようになります。

1. TeX ファイルをコンパイル (uplatex)
2. 参考文献 BibTeX 作成 (pbibtex)
3. TeX コンパイル (uplatex)
4. 索引 MakeIndex 作成 (mendex)
5. TeX コンパイル (uplatex)
6. TeX コンパイル (uplatex)
7. PDF 作成 (dvipdfmx)

latexmk を使うと楽に処理することができます.


** latexmake で biblatex を使う
:PROPERTIES:
:LOCATION: Office
:Added: [2018-08-23 木 09:11]
:ID:       6d5f31da-e134-4b32-b123-2ea7329d55ce
:END:
:LOGBOOK:
- State "DONE"       from "NEXT"       [2018-08-23 木 14:06]
:END:
:CLOCK:
CLOCK: [2018-08-23 木 13:18]--[2018-08-23 木 14:06] =>  0:48
CLOCK: [2018-08-23 木 09:11]--[2018-08-23 木 09:12] =>  0:01
:END:

/~/.latexmkrc/ を次のように変更します。

#+BEGIN_SRC sh  :eval no
$bibtex = 'biber';
#+END_SRC


** 日本語で texinfo を使ってみる                                   :@Office:
:PROPERTIES:
:LOCATION: Office
:Added: [2018-09-04 火 10:22]
:ID:       a7369611-76b2-4e24-b846-5225f2e2ba5b
:END:
:LOGBOOK:
- State "DONE"       from "NEXT"       [2018-09-04 火 17:42]
:END:
:CLOCK:
CLOCK: [2018-09-04 火 12:50]--[2018-09-04 火 17:39] =>  4:49
CLOCK: [2018-09-04 火 10:28]--[2018-09-04 火 12:19] =>  1:51
CLOCK: [2018-09-04 火 10:22]--[2018-09-04 火 10:23] =>  0:01
:END:

- https://github.com/trueroad/texinfo-sample-jp
- https://github.com/ikazuhiro/texinfo-sample-jp.git

* Beamer を使う                                           :RefileTarget:
:PROPERTIES:
:LOCATION: Home
:Added:    [2018-08-31 金 21:00]
:ID:       1a6215f1-1b1e-442c-aa03-f9ccfe60f869
:END:
:LOGBOOK:
- State "DONE"       from "NEXT"       [2018-09-13 木 17:41]
:END:
:CLOCK:
CLOCK: [2018-09-13 木 14:44]--[2018-09-13 木 17:38] =>  2:54
CLOCK: [2018-09-03 月 09:19]--[2018-09-03 月 09:20] =>  0:01
CLOCK: [2018-09-03 月 09:09]--[2018-09-03 月 09:19] =>  0:10
CLOCK: [2018-09-03 月 09:08]--[2018-09-03 月 09:09] =>  0:01
CLOCK: [2018-08-31 金 21:01]--[2018-09-03 月 09:08] => 60:07
CLOCK: [2018-08-31 金 21:00]--[2018-08-31 金 21:01] =>  0:01
:END:

- [[https://ryogan.org/blog/2016/01/06/emacs-org-mode-%25E3%2581%25AE-beamer-export-%25E3%2581%25AB%25E3%2581%25A4%25E3%2581%2584%25E3%2581%25A6%25E5%25B0%2591%25E3%2581%2597/][Emacs Org Mode の Beamer Export について少し | 澍法雨]]
- [[https://texwiki.texjp.org/?Beamer][Beamer - TeX Wiki]]
- [[https://qiita.com/zr_tex8r/items/69e8cc32038ff29f5ac3][今さら人に聞けない「日本語でBeamer」のキホン]]
- [[https://qiita.com/kyosuu1/items/c1d4eb021c471f6025e8][TeX Beamerのカスタムテーマを作ろう]]
- [[https://qiita.com/htlsne/items/70cbb488e7a87cd9e228][LaTeX Beamerの"Beamerらしく"ないおすすめテーマ集]]
- [[https://qiita.com/Kgm1500/items/43b0a358963cc2b796e1][RobotoとNoto Sans CJKを用いて，見やすいBeamerのスライドを作る]]
- [[http://motchy99.blog.fc2.com/blog-entry-79.html][motchyの備忘録 Beamer のテーマファイル(sty)の置き場所]]
- [[http://deic.uab.es/~iblanes/beamer_gallery/index_by_theme.html][Beamer theme gallery]]

** dvipdfmx でヒラギノを使う                                         :@Home:
:PROPERTIES:
:LOCATION: Home
:Added:    [2018-08-07 火 21:32]
:ID:       e9dcb8a8-71ad-414e-85b9-96f538ed3e33
:END:
:CLOCK:
CLOCK: [2018-08-07 火 21:32]--[2018-08-07 火 21:33] =>  0:01
:END:

: sudo kanji-config-updmap -sys hiragino


#+BEGIN_SRC sh
ln -fs "/home/shimano/.fonts/ヒラギノ明朝 Pro W3.otf" /home/shimano/texmf/fonts/opentype/hiragino/HiraMinPro-W3.otf
ln -fs "/home/shimano/.fonts/ヒラギノ明朝 Pro W6.otf" /home/shimano/texmf/fonts/opentype/hiragino/HiraMinPro-W6.otf
ln -fs "/home/shimano/.fonts/ヒラギノ丸ゴ Pro W4.otf" /home/shimano/texmf/fonts/opentype/hiragino/HiraMaruPro-W4.otf
ln -fs "/home/shimano/.fonts/ヒラギノ角ゴ Pro W3.otf" /home/shimano/texmf/fonts/opentype/hiragino/HiraKakuPro-W3.otf
ln -fs "/home/shimano/.fonts/ヒラギノ角ゴ Pro W6.otf" /home/shimano/texmf/fonts/opentype/hiragino/HiraKakuPro-W6.otf
ln -fs "/home/shimano/.fonts/ヒラギノ角ゴ Pro W8.otf" /home/shimano/texmf/fonts/opentype/hiragino/HiraKakuPro-W8.otf
ln -fs "/home/shimano/.fonts/ヒラギノ明朝 ProN W3.otf" /home/shimano/texmf/fonts/opentype/hiragino/HiraMinProN-W3.otf
ln -fs "/home/shimano/.fonts/ヒラギノ明朝 ProN W6.otf" /home/shimano/texmf/fonts/opentype/hiragino/HiraMinProN-W6.otf
ln -fs "/home/shimano/.fonts/ヒラギノ丸ゴ ProN W4.otf" /home/shimano/texmf/fonts/opentype/hiragino/HiraMaruProN-W4.otf
ln -fs "/home/shimano/.fonts/ヒラギノ角ゴ ProN W3.otf" /home/shimano/texmf/fonts/opentype/hiragino/HiraKakuProN-W3.otf
ln -fs "/home/shimano/.fonts/ヒラギノ角ゴ ProN W6.otf" /home/shimano/texmf/fonts/opentype/hiragino/HiraKakuProN-W6.otf
ln -fs "/home/shimano/.fonts/ヒラギノ角ゴ ProN W8.otf" /home/shimano/texmf/fonts/opentype/hiragino/HiraKakuProN-W8.otf
#+END_SRC

#+RESULTS:

*** dvipdfmx でヒラギノを使う                                     :@Office:
:PROPERTIES:
:LOCATION: Office
:Added: [2016-08-01 Mon 13:25]
:ID:       245d2752-8595-491f-8163-f1b0bb85174d
:END:
:LOGBOOK:
- State "DONE"       from "NEXT"       [2016-08-01 Mon 17:04]
:END:
:CLOCK:
CLOCK: [2016-08-01 Mon 17:00]--[2016-08-01 Mon 17:01] =>  0:01
CLOCK: [2016-08-01 Mon 13:26]--[2016-08-01 Mon 17:00] =>  3:34
:END:
#+INDEX: \LaTeX!ヒラギノ

- https://texwiki.texjp.org/?TeX%20Live%2FMac#i9febc9b


#+BEGIN_SRC sh :eval no
sudo mkdir -p /usr/local/texlive/texmf-local/fonts/opentype/hiragino/
cd /usr/local/texlive/texmf-local/fonts/opentype/hiragino/
sudo ln -s "/home/shimano/.fonts/ヒラギノ明朝 Pro W3.otf" ./HiraMinPro-W3.otf
sudo ln -s "/home/shimano/.fonts/ヒラギノ明朝 Pro W6.otf" ./HiraMinPro-W6.otf
sudo ln -s "/home/shimano/.fonts/ヒラギノ丸ゴ Pro W4.otf" ./HiraMaruPro-W4.otf
sudo ln -s "/home/shimano/.fonts/ヒラギノ角ゴ Pro W3.otf" ./HiraKakuPro-W3.otf
sudo ln -s "/home/shimano/.fonts/ヒラギノ角ゴ Pro W6.otf" ./HiraKakuPro-W6.otf
sudo ln -s "/home/shimano/.fonts/ヒラギノ角ゴ Std W8.otf" ./HiraKakuStd-W8.otf

sudo mktexlsr
#+END_SRC

ヒラギノのNシリーズ（JIS X 0213:2004に対応した字形）を
利用する場合（upLaTeX には, 
=\usepackage[uplatex,jis2004]{otf}= とすれば使えます。

#+BEGIN_SRC sh :eval no
sudo ln -s "/home/shimano/.fonts/ヒラギノ明朝 ProN W3.otf" ./HiraMinProN-W3.otf
sudo ln -s "/home/shimano/.fonts/ヒラギノ明朝 ProN W6.otf" ./HiraMinProN-W6.otf
sudo ln -s "/home/shimano/.fonts/ヒラギノ丸ゴ ProN W4.otf" ./HiraMaruProN-W4.otf
sudo ln -s "/home/shimano/.fonts/ヒラギノ角ゴ ProN W3.otf" ./HiraKakuProN-W3.otf
sudo ln -s "/home/shimano/.fonts/ヒラギノ角ゴ ProN W6.otf" ./HiraKakuProN-W6.otf
sudo ln -s "/home/shimano/.fonts/ヒラギノ角ゴ StdN W8.otf" ./HiraKakuStdN-W8.otf
sudo mktexlsr
sudo updmap-sys --setoption kanjiEmbed hiragino
#+END_SRC


#+BEGIN_SRC sh 
ln -fs "/home/shimano/.fonts/ヒラギノ角ゴ Std W8.otf" /home/shimano/texmf/fonts/opentype/hiragino/HiraKakuStd-W8.otf
ln -fs "/home/shimano/.fonts/ヒラギノ明朝 ProN W3.otf" /home/shimano/texmf/fonts/opentype/hiragino/HiraMinProN-W3.otf
ln -fs "/home/shimano/.fonts/ヒラギノ明朝 ProN W6.otf" /home/shimano/texmf/fonts/opentype/hiragino/HiraMinProN-W6.otf
ln -fs "/home/shimano/.fonts/ヒラギノ丸ゴ ProN W4.otf" /home/shimano/texmf/fonts/opentype/hiragino/HiraMaruProN-W4.otf
ln -fs "/home/shimano/.fonts/ヒラギノ角ゴ ProN W3.otf" /home/shimano/texmf/fonts/opentype/hiragino/HiraKakuProN-W3.otf
ln -fs "/home/shimano/.fonts/ヒラギノ角ゴ ProN W6.otf" /home/shimano/texmf/fonts/opentype/hiragino/HiraKakuProN-W6.otf
ln -fs "/home/shimano/.fonts/ヒラギノ角ゴ StdN W8.otf" /home/shimano/texmf/fonts/opentype/hiragino/HiraKakuStdN-W8.otf
#+END_SRC

#+RESULTS:


*** 小塚フォントを Ubuntu に入れて, LaTeX から使う                  :@Home:
:PROPERTIES:
:LOCATION: Home
:Added:    [2016-08-03 Wed 08:38]
:ID:       cbcc1e32-84de-4b88-aecf-4be5fc189458
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2016-08-03 Wed 11:29]
:END:
:CLOCK:
CLOCK: [2016-08-03 Wed 08:38]--[2016-08-03 Wed 08:39] =>  0:01
:END:

- http://www.fugenji.org/~thomas/texlive-guide/font_setup.html が参考になります.

**** 小塚フォントのファイルのコピー
:PROPERTIES:
:ID:       e1f3ef96-cc5c-47ad-af36-ea7a8a989bf4
:END:
:LOGBOOK:
- State "DONE"       from "NEXT"       [2016-08-03 Wed 10:46]
:END:
:CLOCK:
CLOCK: [2016-08-03 Wed 10:25]--[2016-08-03 Wed 10:28] =>  0:03
CLOCK: [2016-08-03 Wed 09:35]--[2016-08-03 Wed 09:36] =>  0:01
CLOCK: [2016-08-03 Wed 09:04]--[2016-08-03 Wed 09:35] =>  0:31
CLOCK: [2016-08-03 Wed 08:55]--[2016-08-03 Wed 09:03] =>  0:08
:END:
**** TeX Live への小塚フォントの登録
:PROPERTIES:
:ID:       8282c5bb-72bb-45dd-befe-c7381670127f
:END:
:LOGBOOK:
- State "DONE"       from "NEXT"       [2016-08-03 Wed 11:29]
:END:
:CLOCK:
CLOCK: [2016-08-03 Wed 10:28]--[2016-08-03 Wed 11:29] =>  1:01
:END:
#+INDEX: こづかふぉんと@小塚フォント

#+BEGIN_SRC sh :eval no
sudo mkdir -p /usr/local/texlive/texmf-local/fonts/opentype/kozuka/
cd /usr/local/texlive/texmf-local/fonts/opentype/kozuka/
sudo ln -fs /home/shimano/.fonts/KozGoPr6N-Medium.otf ./KozGoPro-Regular.otf
sudo ln -fs /home/shimano/.fonts/KozMinPr6N-Regular.otf ./KozMinPro-Regular.otf
sudo mktexlsr 
sudo updmap-sys --setoption kanjiEmbed kozuka 
#+END_SRC

*** 游明朝体・游ゴシック体をMac OS XのLaTeXで使う                 :@Office:
:PROPERTIES:
:LOCATION: Office
:Added: [2016-08-03 Wed 10:04]
:ID:       98b715ae-d940-4b5d-a000-26aa9afc0b20
:END:
:LOGBOOK:
- State "DONE"       from "NEXT"       [2016-08-03 Wed 11:57]
:END:
:CLOCK:
CLOCK: [2016-08-03 Wed 11:36]--[2016-08-03 Wed 11:57] =>  0:21
CLOCK: [2016-08-03 Wed 10:04]--[2016-08-03 Wed 10:05] =>  0:01
:END:

- [[http://tandoori.hatenablog.com/entry/20131117/1384696037][游明朝体・游ゴシック体をMac OS XのLaTeXで使う]]

* NEXT jsclass 用のスタイルファイルを作る
DEADLINE: <2019-03-kkk12 火>
:PROPERTIES:
:ID:       5b9d3357-ca49-498c-9e71-15dfd0d6abbc
:END:
:CLOCK:
CLOCK: [2019-02-28 木 13:47]--[2019-02-28 木 17:37] =>  3:50
CLOCK: [2019-02-28 木 09:21]--[2019-02-28 木 12:14] =>  2:53
CLOCK: [2019-02-25 月 17:57]--[2019-02-25 月 18:06] =>  0:09
CLOCK: [2019-02-25 月 12:47]--[2019-02-25 月 17:53] =>  5:06
CLOCK: [2019-02-25 月 09:47]--[2019-02-25 月 12:17] =>  2:30
:END:


*** 索引のスタイルの変更方法                                      :@Office:
:PROPERTIES:
:ID:       e9d7198b-451b-43b6-97ab-9e139f7c33c1
:END:
:LOGBOOK:
- State "DONE"       from "NEXT"       [2016-09-01 Thu 13:28]
:END:
:CLOCK:
CLOCK: [2016-08-30 Tue 18:14]--[2016-08-30 Tue 18:15] =>  0:01
CLOCK: [2016-08-30 Tue 17:22]--[2016-08-30 Tue 18:14] =>  0:52
CLOCK: [2016-08-30 Tue 17:01]--[2016-08-30 Tue 17:22] =>  0:21
:END:
#+INDEX: mendex!さくいんすたいる@索引スタイル
#+INDEX: mendex
#+INDEX: mendex!ist ファイル

- [[http://www.biwako.shiga-u.ac.jp/sensei/kumazawa/tex/etc03.html][makeidx.sty: LaTeX パッケージ]] を参考にしました.

ist ファイルを格納するディレクトリを作成します.

#+CAPTION: texmf/makeindex の作成
#+NAME: make-texmf-makeindex
#+BEGIN_SRC shellinput :tangle no
mkidr -p texmf/makeindex
#+END_SRC


そのディレクトリの中に line.ist という次の内容のファイルを作成します.

#+NAME: example-of-ist-file
#+CAPTION: ist ファイルの例(line.ist)
#+BEGIN_SRC latex :exports code :eval none
preamble
"\n\\begin{theindex}\n"
postamble
"\n\n \\end{theindex}\n"
item_x0   "\n\\item "
item_x1   "\n \\subitem "
item_x2   "\n  \\subsubitem "
delim_0   "\\hfill "
delim_1   "\\hfill "
delim_2   "\\hfill "
%
% mendex
lethead_prefix
"\\hbox to \\linewidth{\\hfill\\gtfamily\\bfseries "
lethead_suffix
"\\hfill}\\par\n\\nopagebreak\n"
lethead_flag       1
symbol             "記号／数字"
letter_head        2
% makeindex
heading_prefix
"{\\vbox{\\hbox to \\linewidth{\\gtfamily\\bfseries "
heading_suffix
"\\ \\hskip\\fill}\\vskip1pt\\hrule}}\\nopagebreak\n"
headings_flag      1
#+END_SRC

#+NAME: mendex-with-ist-example
#+CAPTION: mendex の処理方法
#+BEGIN_SRC shellinput :tangle no
mendex -r -c -g -s line.ist -p any OriginalEngineearHandobook.idx
#+END_SRC

** JabRef を使う
:PROPERTIES:
:ID:       2b8303be-e1a9-4250-b528-03a9c52439bf
:END:
:LOGBOOK:
- State "DONE"       from "NEXT"       [2016-09-02 Fri 16:24]
:END:
:CLOCK:
CLOCK: [2016-09-02 Fri 16:01]--[2016-09-02 Fri 16:24] =>  0:23
:END:

- https://www.jabref.org/
- http://askubuntu.com/questions/721378/how-to-properly-install-latest-jabref

https://www.fosshub.com/JabRef.html/JabRef_3.6.jar をダウンロードします.

ダウンロードした jar ファイルを

: mv JabRef_3.6.jar ~/.emacs.d/bin 

: java -jar .emacs.d/bin/JabRef_3.6.jar

java -Dhttp.proxyHost=http://rep.proxy.nic.fujitsu.com -Dhttp.proxyUser=shimano.yoshio%40jp.fujitsu.com -Dhttp.proxyPassword=9503861970 -Dhttp.proxyPort=8080 -jar .emacs.d/bin/JabRef_3.6.jar

Proxy が有効になりません. まあ,いっか.


** bibtex のスタイルファイルを変更する                             :@Office:
:PROPERTIES:
:ID:       c7b39ca3-d5fe-429d-bc2d-68c56a9f8087
:END:
:LOGBOOK:
- State "DONE"       from "NEXT"       [2016-09-06 Tue 15:02]
:END:
:CLOCK:
CLOCK: [2016-09-06 Tue 14:15]--[2016-09-06 Tue 15:02] =>  0:47
:END:

- https://texwiki.texjp.org/?%E6%96%87%E7%8C%AE%E5%BC%95%E7%94%A8
- [[http://shirotakeda.org/ja/tex-ja/jecon-ja.html#_4][jecon.bst: 経済学用BibTeXスタイルファイル]]

を参考にしました。

- https://github.com/ShiroTakeda/jecon-bst/releases

から最新のファイルをダウンロードします。

- jecon.bst
- customization/jecon_*.bst 

を

- ~/texmf/bibtex/bst

にコピーします。

jecon_b.bst を shimano.bst にコピーし、 自分の好みに合うように変更しました。


** LaTeX の箇条書きのみためを改善する
:PROPERTIES:
:ID:       8723dccd-6f22-4734-a63a-1722feaf8df1
:END:
:LOGBOOK:
- State "DONE"       from "NEXT"       [2016-09-06 Tue 14:14]
:END:
:CLOCK:    
CLOCK: [2016-09-06 Tue 13:28]--[2016-09-06 Tue 14:14] =>  0:46
CLOCK: [2016-09-06 Tue 11:32]--[2016-09-06 Tue 12:39] =>  1:07
- State "DONE"       from "NEXT"       [2015-01-07 水 11:33]
CLOCK: [2015-01-07 水 09:07]--[2015-01-07 水 11:33] =>  2:26
:END:      
#+INDEX: \LaTeX!かじょうがき@箇条書き

標準の \LaTeX のリスト環境は見栄えが少し悪いので少し改善します。
enumite.sty を使って見栄えを変更します。

- [[http://mytexpert.sourceforge.jp/index.php?plugin%3Drelated&page%3D%25B9%25A5%25A4%25AD%25B9%25A5%25A4%25ADLaTeX2e%252F%25BD%25E9%25B5%25E9%25CA%25D4][Backlinks for: 好き好きLaTeX2e/初級編 - MyTeXpert]] が参考になります.
- [[http://ctan.org/pkg/enumitem][CTAN: Package enumitem]] が良いようです.
- [[http://www.biwako.shiga-u.ac.jp/sensei/kumazawa/tex/enumitem.html][enumitem.sty: LaTeX パッケージ]] が詳しい.


** TODO emph を蛍光ペンでひいたようなスタイルにする
DEADLINE: <2019-04-06 Sat>
:PROPERTIES:
:ID:       c99fc610-41aa-4ced-912a-421093bc42f1
:END:
:LOGBOOK:
- State "TODO"       from "DONE"       [2019-04-01 月 09:21]
- State "DONE"       from "NEXT"       [2019-02-12 火 13:49]
:END:
:CLOCK:
CLOCK: [2019-02-12 火 12:46]--[2019-02-12 火 13:49] =>  1:03
CLOCK: [2019-02-12 火 10:35]--[2019-02-12 火 12:17] =>  1:42
:END:

- [[http://doratex.hatenablog.jp/entry/20171219/1513609345][行分割可能な \fbox をつくる - TeX Alchemist Online]]

を参考にしました。

=uline--.sty= をいただいてきます。


#+begin_src latex
\uline[background,color={[rgb]{1,1,0.4}},width=5pt,position=1pt]{蛍光ペン}で
\uline[background,color={[rgb]{1,0.4,1}},width=1zw,position=.38zw]{塗ってみよう}
#+end_src

*** スタイルファイルを作成する                                    :@Office:
:PROPERTIES:
:ID:       e90c6e8c-42f1-423a-b8e3-c571a6ca5ef3
:END:
:LOGBOOK:
- State "DONE"       from              [2016-09-07 Wed 10:20]
:END:
:CLOCK:
CLOCK: [2016-09-02 Fri 16:42]--[2016-09-02 Fri 17:34] =>  0:52
:END:

- =~/texmf/latex/shimano=

という名前のスタイルファイルを作成します。

: mkdir -p ~/texmf/latex/shimano

*** 表紙を変更する
:PROPERTIES:
:ID:       4a18d23a-dc6f-45e4-aede-1d117b071ca6
:END:
:CLOCK:
CLOCK: [2016-09-06 Tue 17:00]--[2016-09-06 Tue 17:40] =>  0:40
:END:

#+NAME: change-latex-titepage-style
#+CAPTION: 表紙のスタイルの変更
#+BEGIN_SRC latex  :exports code :eval none
\def\FileVerjou#1{\gdef\@FileVerjou{#1}}

% \contact{Author's Address}, \FileVerj{<verison>}
% 後記の titlepage 環境に必要
\global\let\@contact\@empty
\def\contact#1{\gdef\@contact{#1}}
\global\let\@version\@empty

% 表紙ページのスタイルの変更
\renewcommand{\maketitle}{%
  \begin{titlepage}%
    \parindent=0pt%
    \let\footnotesize\small%
    \let\footnoterule\relax%
    \let\footnote\thanks%
    \null\vskip3zw%
    \hbox to \fullwidth{%
        \huge\bfseries\@title\hfill}\par\vskip\fboxsep
    \hrule height 1ex\par\vskip\fboxsep
    \hbox to \fullwidth{\hfill{\large\@author}}\par
    \hbox to \fullwidth{\hfill{\large 第{\@FileVerjou}版}}\par
    \hbox to \fullwidth{\hfill{\large\@date}}\par
    \vfill
    \ifx\@contact\@empty\@thanks\vfil\null%
    \else\vfill\@contact\vskip 3ex\fi%
  \end{titlepage}%
\setcounter{footnote}{0}%
\thispagestyle{empty}
\vspace*{\fill}
{\hfil Copyright {\copyright} 2016 Fujitsu Co.\hfil}\\
\begin{quotation}

\end{quotation}
\begin{quotation}
本文章に記載されている企業，団体の名前や製品名等は
それぞれの権利帰属者の商標または商標登録であり所有物です．
本文章では{\texttrademark}及び{\textregistered}は明記し
ていません．
\end{quotation}}%
#+END_SRC

*** shellinput 環境
:PROPERTIES:
:ID:       defa3d55-5d53-416c-bcd7-a9ed28e2fdf6
:END:

#+BEGIN_SRC latex :exports code :eval none
\begin{shellinput}
ls -al
\end{shellinput}
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT latex
\begin{shellinput}
ls -al
\end{shellinput}
#+END_EXPORT



*** shelloutput 環境
:PROPERTIES:
:ID:       2f793328-0c82-489f-85a2-c6a76d51ac28
:END:

シェルの出力を表現する環境です。

#+CAPTION: shelloutput の使用例
#+BEGIN_SRC latex :exports code :eval none
  \begin{shelloutput}[shelloutput の使用例]
  合計 40
  4 drwxr-xr-x 10 shimano shimano 4096  5月 19 09:57 .
  4 drwxr-xr-x 13 shimano shimano 4096  5月 30 12:44 ..
  4 drwxr-xr-x  2 shimano shimano 4096 11月 30 14:55 BBQManual
  4 drwxr-xr-x  8 shimano shimano 4096  5月 30 15:28 EngineerHandobook
  4 drwxr-xr-x  3 shimano shimano 4096 11月 30 14:55 GitHubFlow
  4 drwxrwxr-x  4 shimano shimano 4096  5月 30 11:50 Ionic-Josh
  4 drwxr-xr-x  3 shimano shimano 4096 11月 30 14:55 MakeAmpEnvironment
  4 drwxr-xr-x  3 shimano shimano 4096 11月 30 14:55 MakeVMWithVagrantAndChef
  4 drwxr-xr-x  3 shimano shimano 4096 11月 30 14:55 OrgBook
  4 drwxrwxr-x  4 shimano shimano 4096 12月  8 12:33 UseEmacs
  \end{shelloutput}
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT latex
\begin{shelloutput}[shelloutput の使用例]
合計 40
4 drwxr-xr-x 10 shimano shimano 4096  5月 19 09:57 .
4 drwxr-xr-x 13 shimano shimano 4096  5月 30 12:44 ..
4 drwxr-xr-x  2 shimano shimano 4096 11月 30 14:55 BBQManual
4 drwxr-xr-x  8 shimano shimano 4096  5月 30 15:28 EngineerHandobook
4 drwxr-xr-x  3 shimano shimano 4096 11月 30 14:55 GitHubFlow
4 drwxrwxr-x  4 shimano shimano 4096  5月 30 11:50 Ionic-Josh
4 drwxr-xr-x  3 shimano shimano 4096 11月 30 14:55 MakeAmpEnvironment
4 drwxr-xr-x  3 shimano shimano 4096 11月 30 14:55 MakeVMWithVagrantAndChef
4 drwxr-xr-x  3 shimano shimano 4096 11月 30 14:55 OrgBook
4 drwxrwxr-x  4 shimano shimano 4096 12月  8 12:33 UseEmacs
\end{shelloutput}
#+END_EXPORT



*** marker 環境
:PROPERTIES:
:ID:       05cde917-8dcc-481a-a9a8-e847b335e1cb
:END:

#+BEGIN_SRC latex :exports code :eval none
\begin{marker}
注意書き環境
\end{marker}
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT latex
\begin{marker}
ls -al
\end{marker}
#+END_EXPORT


*** tcolorbox の例
:PROPERTIES:
:ID:       37e9eb36-341c-4259-9f79-06f1f0068ade
:END:

#+NAME: tcolorbox-example
#+CAPTION: tcolorbox の例
#+BEGIN_SRC latex :exports code :eval none
  \begin{tcolorbox}[colback=red!5!white,colframe=red!75!black,title=私の綺麗な見出し]
  これは別の \textbf{tcolorbox} です.
  \tcblower
  ここで, ボックスの下側の部分が見えます.
  \end{tcolorbox}
#+END_SRC

#+results:
#+BEGIN_EXPORT latex
\begin{tcolorbox}[colback=red!5!white,colframe=red!75!black,title=私の綺麗な見出し]
これは別の \textbf{tcolorbox} です.
\tcblower
ここで, ボックスの下側の部分が見えます.
\end{tcolorbox}
#+END_EXPORT

*** TODO tcolorbox のプログラムリストの目次の表記を変更する
:PROPERTIES:
:ID:       95775a1d-115f-4a7e-9ccb-1edc1e3ff777
:END:
:CLOCK:
CLOCK: [2017-05-29 月 13:18]--[2017-05-29 月 16:08] =>  2:50
:END:

#+BEGIN_SRC latex  :exports code :eval none
  % リスト目次の先頭に番号を出さない
  \makeatletter
  \def\tcb@addcontentsline#1#2{%
    \ifx\kvtcb@listentry\@empty%
      \ifx\kvtcb@title\@empty%
        \ifx\tcbtitletext\@empty%
          \addcontentsline{#1}{#2}{{\ignorespaces\kvtcb@savedelimiter}}%
        \else%
          \addcontentsline{#1}{#2}{{\ignorespaces\tcbtitletext}}%
        \fi%
      \else%
        \addcontentsline{#1}{#2}{{\ignorespaces\kvtcb@title}}%
      \fi%
    \else%
      \addcontentsline{#1}{#2}{\kvtcb@listentry}%
    \fi%
  }
  \makeatother

#+END_SRC

** TODO 游明朝でプロポーショナルで組む
DEADLINE: <2019-05-01 Wed>
:PROPERTIES:
:ID:       7a44a1c6-5a8c-48b1-b5b3-239e7d7a695d
:END:
:LOGBOOK:
- State "TODO"       from "DONE"       [2019-04-01 月 09:22]
- State "DONE"       from "NEXT"       [2019-02-21 木 17:40]
:END:
:CLOCK:
CLOCK: [2019-02-21 木 12:38]--[2019-02-21 木 12:39] =>  0:01
CLOCK: [2019-02-21 木 11:48]--[2019-02-21 木 12:37] =>  0:49
CLOCK: [2019-02-21 木 09:10]--[2019-02-21 木 11:48] =>  2:38
:END:
** NEXT LuaLaTeX で Biz UD ゴシック体で、プロポーショナルで組む
DEADLINE: <2019-04-04 Thu>
:PROPERTIES:
:ID:       017af18d-5d1d-40a0-b359-bd67b5d19f86
:END:
:LOGBOOK:
- State "TODO"       from "DONE"       [2019-04-01 月 09:21]
- State "DONE"       from "NEXT"       [2019-02-22 金 17:25] \\
  よくない
:END:
:CLOCK:
CLOCK: [2019-02-22 金 12:47]--[2019-02-22 金 17:25] =>  4:38
CLOCK: [2019-02-22 金 09:03]--[2019-02-22 金 12:13] =>  3:10
CLOCK: [2019-02-21 木 12:40]--[2019-02-21 木 17:35] =>  4:55
:END:

** pdfTeX で日本語を使う
:PROPERTIES:
:ID:       2cf10f67-e6c7-4806-80ce-cfd8bab9173b
:END:
:LOGBOOK:  
- State "DONE"       from "TODO"       [2015-03-10 火 17:31]
:END:      
:CLOCK:    
CLOCK: [2015-03-10 火 10:14]--[2015-03-10 火 10:15] =>  0:01
:END:      

- [[http://oku.edu.mie-u.ac.jp/~okumura/texwiki/?pdfTeX][pdfTeX - TeX Wiki]]
- [[http://oku.edu.mie-u.ac.jp/~okumura/texwiki/?LaTeX-CJK][LaTeX-CJK - TeX Wiki]]

** LuaLaTeX を使ってみる
:PROPERTIES:
:ID:       ce901784-c021-48e5-9196-f6659aa25572
:END:
:CLOCK:
CLOCK: [2019-01-18 金 10:52]--[2019-01-18 金 11:27] =>  0:35
CLOCK: [2019-01-18 金 09:47]--[2019-01-18 金 10:50] =>  1:03
:END:


結論 : LuaLaTeX は遅すぎて使いものにならない。

もう少しあがいてみる。

curl -LsSf https://raw.githubusercontent.com/tats-u/enable-luajitlatex/master/enable-luajitlatex.sh | sudo PATH="$PATH" sh


